app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
	def index
		@article = Article.all

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Lovely Day"], ["body", "I went to the beach today!"], ["created_at", "2015-09-30 07:21:55.973016"], ["updated_at", "2015-09-30 07:21:55.973016"]]
---
	def create
		@article = Article.new(article_params)
			#title: params[:article][:title],
			#body: params[:article][:body])
		@article.save