app/controllers/authors_controller.rb

INSERT INTO "authors" ("username", "email", "salt", "crypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save

DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 1]]
---
  def destroy
    @author.destroy