app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags"
---
	def index
		@tag = Tag.all

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 0]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 2]]
---
	def destroy
		@tag = Tag.find(params[:id])
		@tag.delete

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@tag = Tag.find(params[:id])

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 4]]
---
	def update
		@tag = Tag.find(params[:id])